SampleCode/Emacs/emacs.org
#+title: Emacs 
#+author: Ray.Kuo

* Basic

** Hot-key
   - S-Right/Left/Up/Down : select words
   - M-w : [kill-ring-save] copy 
   - C-y : [yank] paste
   - C-h : [help]
     - ? : display detail
     - v : [describe-variable]
     - f : [describe-function]
     - k : [describe-key]

* How to install evil mode manually 

   git clone --depth 1 https://github.com/emacs-evil/evil.git
   
   mkdir ~/.emacs.d/init.el
   
   (add-to-list 'load-path "~/Project/ITHelp/SampleCode/Emacs/evil")
   (require 'evil)
   (evil-mode 1)

* evil-mode

** Hot-key
  - C-b : Page Up
  - C-d : 1/2 Page Up
  - C-f : Page Down
  - C-u : 1/2 Page Down
  - ) : jump forward one sentence
  - ( : jump backward one sentence
  - { : jump forward one paragraph 
  - } : jump backward one paragraph
  - H : Jump to the top of the screen
  - M : Jump to the middle of the screen
  - L : Jump to the bottom of the screen

** Reference
   - [How To Page Up and Page Down In Vim/Vi?](https://linuxtect.com/how-to-page-up-and-page-down-in-vim-vi/)
   - [Vim Tip - Moving around](https://vim.fandom.com/wiki/Moving_around)

* [[https://orgmode.org/][org-mode]]

** Hot-key
  - S-Left/Right :
    1. in head * : [org-todo]
    2. in list : [org-do-promote/org-do-demote]
    3. in table : [org-table-move-column-left/right]

  | A | B |
  | 1 | 2 |
 
  - M-Enter
  - [org-open-at-point] : C-c C-o --- open link  
  - [org-insert-link]  C-c C-l : edit link
  - [org-todo]       : C-c C-t  add "TODO"
  - [org-schedule]   : C-c C-s  
    - < : backward one month
    - > : forward one month
    - ? : info
    - o : other day
    - . : today
  - [org-deadline]   : C-c C-d  
  - [org-goto]       : C-c C-j  
  - [org-time-stamp] : C-c .
    
  | org-todo                         | S-Left/Right | add "TODO" in head             |
  | org-do-promote/org-do-demote     | S-Left/Right | in list                        |
  | org-table-move-column-left/right | S-Left/Right | in table                       |
  | org-open-at-point                | C-c C-o      | open link                      |
  | org-insert-link                  | C-c C-l      | insert a link                  |
  | org-todo                         | C-c C-t      | add "TODO"                     |
  | org-schedule                     | C-c C-s      |                                |
  |                                  | <            | backward one month             |
  |                                  | >            | forward one month              |
  |                                  | ?            | info                           |
  |                                  | o            | other day                      |
  |                                  | .            | today                          |
  | org-deadline                     | C-c C-d      |                                |
  | org-goto                         | C-c C-j      |                                |
  | org-time-stamp                   | C-c .        | <2022-01-18 Tue>               |
  | org-time-stamp-inactive          | C-c !        | [2022-01-19 Tue]               |
  | org-date-from-calendar           | C-c <        | <2022-01-20 Tue>               |
  | org-goto-calendar                | C-c >        |                                |
  | org-open-at-point                | C-c C-o      | Access the agenda for the date |
  |                                  |              |                                |

** reference
   - [[https://orgmode.org/][Org Mode Official WebSite]]
   - [[https://orgmode.org/quickstart.html][Org Mode quick start]]
   - [[https://orgmode.org/guide/][Org Mode guide]]
   - [The Org Manual](https://orgmode.org/manual/)
   - [The Org Manual](https://www.gnu.org/software/emacs/manual/html_mono/org.html)
   - [Exporting from org-mode to markdown](https://emacs.stackexchange.com/questions/4279/exporting-from-org-mode-to-markdown)
     1) M-x customize-option
	1) org-export-backends
	2) Enter
     2) M-x org-md-export-to-markdown 

* [[https://stackoverflow.com/questions/6874516/relative-line-numbers-in-emacs][Relative Line Numbers In Emacs]]

  [Relative Line Numbers In Emacs](https://stackoverflow.com/questions/6874516/relative-line-numbers-in-emacs)

   #+begin_src emacs-lisp
   (global-display-line-numbers-mode 1)
   (setq display-line-numbers-type 'relative)
   #+end_src

* Reference
  
  [EMACS-DOCUMENT](http://blog.lujun9972.win/emacs-document/)    
  [一年成为Emacs高手 (像神一样使用编辑器)](https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org)
  [Evil](https://evil.readthedocs.io/en/latest/index.html)
  [MELPA](https://melpa.org/)
  [EMACS 新思維](https://ithelp.ithome.com.tw/users/20084176/ironman/674?page=1)
